In [1]:
import numpy as np
import pandas as pd

In [2]:
# 1)names没赋值，header也没赋值
df = pd.read_csv('E:\panda\students_whitespace.txt',delim_whitespace=True) 
df
print(df)

   id name address gender    birthday
0   1   张三     地球村      女   2004/11/2
1   2   李四     月亮星      女    2003/8/7
2   3   王五     艾尔星      女   2004/11/2
3   4   赵六     克哈星      男  2003/10/11
4   5   小明     查尔星      男   2002/6/12
5   6   小花    塔桑尼斯      男   2002/2/12

In [3]:
# 2）names被赋值，header没有被赋值
# 当names被赋值，会把names作为表头，header=None(names适用于没有表头的情况)
df = pd.read_csv('E:\panda\students_whitespace.txt',
                 delim_whitespace=True,
                 names=['编号','姓名','地址','性别','出生日期'],)
df

   编号    姓名       地址      性别        出生日期
0  id  name  address  gender    birthday
1   1    张三      地球村       女   2004/11/2
2   2    李四      月亮星       女    2003/8/7
3   3    王五      艾尔星       女   2004/11/2
4   4    赵六      克哈星       男  2003/10/11
5   5    小明      查尔星       男   2002/6/12
6   6    小花     塔桑尼斯       男   2002/2/12

In [4]:
# 3）names 和 header都被赋值
df = pd.read_csv('E:\panda\students_whitespace.txt',
                 delim_whitespace=True,
                 names=['编号','姓名','地址','性别','出生日期'],
                header=0)
df

   编号  姓名    地址 性别        出生日期
0   1  张三   地球村  女   2004/11/2
1   2  李四   月亮星  女    2003/8/7
2   3  王五   艾尔星  女   2004/11/2
3   4  赵六   克哈星  男  2003/10/11
4   5  小明   查尔星  男   2002/6/12
5   6  小花  塔桑尼斯  男   2002/2/12

In [5]:
# 4）names没有被赋值，header被赋值
# header=1，拿数据第二行作为表头
df = pd.read_csv('E:\panda\students_whitespace.txt',delim_whitespace=True,header=1)
df

   1  张三   地球村  女   2004/11/2
0  2  李四   月亮星  女    2003/8/7
1  3  王五   艾尔星  女   2004/11/2
2  4  赵六   克哈星  男  2003/10/11
3  5  小明   查尔星  男   2002/6/12
4  6  小花  塔桑尼斯  男   2002/2/12

In [6]:
"""
names 和 header的使用场景如下：
  1）csv文件有表头并且是第一行，那names和header都无需指定；
  2）csv文件有表头、但表头不是第一行，可能从下面几行才是真正的表头和数据，这时指定header
  即可
  3）csv文件没表头，全部是纯数据，那我们可以通过names手动生成表头
  4）csv文件没表头，但是这个表头你不想用，这个时候同时指定names 和header。先用header选出的
  表头和数据，然后再用names将表头其换掉，就等价于将数据读取后再对列名进行rename
"""

'\nnames 和 header的使用场景如下：\n  1）csv文件有表头并且是第一行，那names和header都无需指定；\n  2）csv文件有表头、但表头不是第一行，可能从下面几行才是真正的表头和数据，这时指定header\n  即可\n  3）csv文件没表头，全部是纯数据，那我们可以通过names手动生成表头\n  4）csv文件没表头，但是这个表头你不想用，这个时候同时指定names 和header。先用header选出的\n  表头和数据，然后再用names将表头其换掉，就等价于将数据读取后再对列名进行rename\n'

In [7]:
# 4.index_col:在读取文件后所得到的DataFrames
df = pd.read_csv('E:\panda\students1.csv',encoding='gbk',index_col='birthday')
df
print(df)
print('-------------------------')
a = df.index
print(a)

            id name address gender
birthday
2004/11/2    1  蔡梦丹     地球村      女
2003/8/7     2  杨萌渝     月亮星      女
2004/11/2    3  何晶晶     艾尔星      女
2003/10/11   4   张怡     克哈星      男
2002/6/12    5  郭志阳     查尔星      男
2002/2/12    6  马成功    塔桑尼斯      男
-------------------------
Index(['2004/11/2', '2003/8/7', '2004/11/2', '2003/10/11', '2002/6/12',
       '2002/2/12'],
      dtype='object', name='birthday')

In [8]:
#  把这个数据类型dtype='object'转化成时间操作
df.index = pd.to_datetime(df.index)
df.index

DatetimeIndex(['2004-11-02', '2003-08-07', '2004-11-02', '2003-10-11',
               '2002-06-12', '2002-02-12'],
              dtype='datetime64[ns]', name='birthday', freq=None)

In [9]:
df['2004']
    
df.loc['2004-11-2']

            id name address gender
birthday
2004-11-02   1  蔡梦丹     地球村      女
2004-11-02   3  何晶晶     艾尔星      女

In [10]:
df = pd.read_csv('E:\panda\students1.csv',encoding='gbk')
df

   id name address gender    birthday
0   1  蔡梦丹     地球村      女   2004/11/2
1   2  杨萌渝     月亮星      女    2003/8/7
2   3  何晶晶     艾尔星      女   2004/11/2
3   4   张怡     克哈星      男  2003/10/11
4   5  郭志阳     查尔星      男   2002/6/12
5   6  马成功    塔桑尼斯      男   2002/2/12

In [11]:
df = pd.read_csv('E:\panda\students1.csv',encoding='gbk',index_col=['id','name'])
df
print(df)
print('---------------------------')
a = df.loc[1,'蔡梦丹']  
print(a)
print('&&&&&&&&&&&&')
print(type(a)) # 数据类型是Series
print("#################################")
b = df.loc[1]
print(b)
print(type(b))# 数据类型是DataFrames

        address gender    birthday
id name
1  蔡梦丹      地球村      女   2004/11/2
2  杨萌渝      月亮星      女    2003/8/7
3  何晶晶      艾尔星      女   2004/11/2
4  张怡       克哈星      男  2003/10/11
5  郭志阳      查尔星      男   2002/6/12
6  马成功     塔桑尼斯      男   2002/2/12
---------------------------
address           地球村
gender              女
birthday    2004/11/2
Name: (1, 蔡梦丹), dtype: object
&&&&&&&&&&&&
<class 'pandas.core.series.Series'>
#################################
     address gender   birthday
name
蔡梦丹      地球村      女  2004/11/2
<class 'pandas.core.frame.DataFrame'>

In [12]:
# usecols:返回列的子集。
# 原数据
df = pd.read_csv('E:\panda\students1.csv',encoding='gbk')
print(df)
# 只要name 和gender
df1 = pd.read_csv('E:\panda\students1.csv',encoding='gbk',usecols=['name','gender'])
df1

   id name address gender    birthday
0   1  蔡梦丹     地球村      女   2004/11/2
1   2  杨萌渝     月亮星      女    2003/8/7
2   3  何晶晶     艾尔星      女   2004/11/2
3   4   张怡     克哈星      男  2003/10/11
4   5  郭志阳     查尔星      男   2002/6/12
5   6  马成功    塔桑尼斯      男   2002/2/12

  name gender
0  蔡梦丹      女
1  杨萌渝      女
2  何晶晶      女
3   张怡      男
4  郭志阳      男
5  马成功      男

In [13]:
# 二.通用解析参数  enconding：编码格式 utf-8  gbk
c = df['id']
print(c)
print('--------------------------')
df = pd.read_csv('E:\panda\students1.csv',encoding='gbk',dtype={'id':float})
print(df)

0    1
1    2
2    3
3    4
4    5
5    6
Name: id, dtype: int64
--------------------------
    id name address gender    birthday
0  1.0  蔡梦丹     地球村      女   2004/11/2
1  2.0  杨萌渝     月亮星      女    2003/8/7
2  3.0  何晶晶     艾尔星      女   2004/11/2
3  4.0   张怡     克哈星      男  2003/10/11
4  5.0  郭志阳     查尔星      男   2002/6/12
5  6.0  马成功    塔桑尼斯      男   2002/2/12

In [14]:
# 设置数据类型str现实就是object
df = pd.read_csv('E:\panda\students1.csv',encoding='gbk',dtype={'id':float,'name':str})
# print(df)
df['id']
df['name']

0    蔡梦丹
1    杨萌渝
2    何晶晶
3     张怡
4    郭志阳
5    马成功
Name: name, dtype: object

In [15]:
# 3.converters:在读取数据的时候对列数据进行变换.例如：将id增加10，但注意int（x），
# 在使用converters参数时，解析器默认所有列的类型为str，所以需要进行类型转换
# 原数据
df = pd.read_csv('E:\panda\students1.csv',encoding='gbk')
print(df)
print('---------------------------')
# 变换后的
df = pd.read_csv('E:\panda\students1.csv',encoding='gbk',converters={'id':lambda x:int(x) + 10})
print(df)

   id name address gender    birthday
0   1  蔡梦丹     地球村      女   2004/11/2
1   2  杨萌渝     月亮星      女    2003/8/7
2   3  何晶晶     艾尔星      女   2004/11/2
3   4   张怡     克哈星      男  2003/10/11
4   5  郭志阳     查尔星      男   2002/6/12
5   6  马成功    塔桑尼斯      男   2002/2/12
---------------------------
   id name address gender    birthday
0  11  蔡梦丹     地球村      女   2004/11/2
1  12  杨萌渝     月亮星      女    2003/8/7
2  13  何晶晶     艾尔星      女   2004/11/2
3  14   张怡     克哈星      男  2003/10/11
4  15  郭志阳     查尔星      男   2002/6/12
5  16  马成功    塔桑尼斯      男   2002/2/12

In [16]:
# 4.true_values 和 false_values：指定哪些值应该被清洗为True，哪些值被清洗为False
# 原数据
df = pd.read_csv('E:\panda\students1.csv',encoding='gbk')
print(df)
print('---------------------------')
# 想将男生清洗为True，女生清洗为False
df1 = pd.read_csv('E:\panda\students1.csv',encoding='gbk',true_values=['男'],false_values=['女'])
df1

   id name address gender    birthday
0   1  蔡梦丹     地球村      女   2004/11/2
1   2  杨萌渝     月亮星      女    2003/8/7
2   3  何晶晶     艾尔星      女   2004/11/2
3   4   张怡     克哈星      男  2003/10/11
4   5  郭志阳     查尔星      男   2002/6/12
5   6  马成功    塔桑尼斯      男   2002/2/12
---------------------------

   id name address gender    birthday
0   1  蔡梦丹     地球村      女   2004/11/2
1   2  杨萌渝     月亮星      女    2003/8/7
2   3  何晶晶     艾尔星      女   2004/11/2
3   4   张怡     克哈星      男  2003/10/11
4   5  郭志阳     查尔星      男   2002/6/12
5   6  马成功    塔桑尼斯      男   2002/2/12

In [24]:
# 原数据
df = pd.read_csv('E:\panda\my.csv')
print(df)
# 清洗过的
df = pd.read_csv('E:\panda\my.csv',true_values=['a'],false_values=['b'])
df

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2022/1/1
1     3    b   3.4  banana  2022/1/2
2     6    a   2.5  orange  2022/1/5
3     5    b   3.2   grape  2022/1/7

   col1   col2  col3    col4      col5
0     2   True   1.4   apple  2022/1/1
1     3  False   3.4  banana  2022/1/2
2     6   True   2.5  orange  2022/1/5
3     5  False   3.2   grape  2022/1/7

In [17]:
# 5.skiprows:表示过滤行，想过滤掉哪些行，就写在一个列表里面传递给skiprows即可 
# 原数据
df = pd.read_csv('E:\panda\students1.csv',encoding='gbk')
print(df)
print('+++++++++++++++++++++++++++++')
# 过滤后的
df1 = pd.read_csv('E:\panda\students1.csv',encoding='gbk',skiprows=[0,3])
print(df1)
"""这是把第一行过滤掉了，因为第一行是表头，所以在过滤之后第二行就变成了表头，当然里面除了
传入具体的数值，来表明为过滤掉哪些行，还可以传入一个函数"""

   id name address gender    birthday
0   1  蔡梦丹     地球村      女   2004/11/2
1   2  杨萌渝     月亮星      女    2003/8/7
2   3  何晶晶     艾尔星      女   2004/11/2
3   4   张怡     克哈星      男  2003/10/11
4   5  郭志阳     查尔星      男   2002/6/12
5   6  马成功    塔桑尼斯      男   2002/2/12
+++++++++++++++++++++++++++++
   1  蔡梦丹   地球村  女   2004/11/2
0  2  杨萌渝   月亮星  女    2003/8/7
1  4   张怡   克哈星  男  2003/10/11
2  5  郭志阳   查尔星  男   2002/6/12
3  6  马成功  塔桑尼斯  男   2002/2/12

'这是把第一行过滤掉了，因为第一行是表头，所以在过滤之后第二行就变成了表头，当然里面除了\n传入具体的数值，来表明为过滤掉哪些行，还可以传入一个函数'

In [19]:
df = pd.read_csv('E:\panda\students1.csv',encoding='gbk',skiprows=lambda x: x>0 and x %2==0 )
print(df)
"""由于索引从0开始，所以凡是索引大于0、并且%2等于0的记录都过滤掉。索引大于0，
是为了保证表头不被过滤掉"""

   id name address gender   birthday
0   1  蔡梦丹     地球村      女  2004/11/2
1   3  何晶晶     艾尔星      女  2004/11/2
2   5  郭志阳     查尔星      男  2002/6/12

'由于索引从0开始，所以凡是索引大于0、并且%2等于0的记录都过滤掉。索引大于0，\n是为了保证表头不被过滤掉'